# using Pkg
# using Pkg; Pkg.activate("./examples")
# Pkg.add(url="https://github.com/kutsjuice/Flexia.git", rev="diag_stat_bars")
# include("real_5bar.jl")
using GLMakie
using LinearAlgebra


traj = []

# F_values = range(0.1, 10.0, length=100)
# ndofs = number_of_dofs(sys)
# results = Matrix{Float64}(undef, ndofs, length(F_values))

# # Начальное приближение для первого шага
# x0 = copy(initial)

# # Временная матрица для хранения одного решения
# sol_temp = Matrix{Float64}(undef, ndofs, 1)

# for (i, F_val) in enumerate(F_values)
#     F = F_val  # Обновляем силу
    
#     # Пересоздаём функтор и якобиан для актуальных сил
#     func = sys.rhs
#     jacoby = (x) -> ForwardDiff.jacobian(func, x)
    
#     # Решаем статическую задачу
#     static_solver!(sol_temp, x0, func, jacoby)
    
#     # Сохраняем результат
#     results[:, i] = sol_temp[:, 1]
    
#     push!(traj, results[bd4_y_ind, end])
#     # Метод продолжения: используем текущее решение как начальное приближение для следующего шага
#     x0 .= sol_temp[:, 1]
# end

f1 = Figure()
traj

traj2 = [0.252206368274955, 0.2522056265253112, 0.2522048847494565, 0.2522041429473902, 0.25220340111911166,
0.25220265926462015, 0.252201917383915, 0.25220117547699566, 0.25220043354386135, 0.2521996915845114, 
0.2521989495989452, 0.25219820758716205, 0.2521974655491612, 0.25219672348494215, 0.2521959813945041,
0.25219523927784643, 0.25219523927784643, 0.2521937549658695, 0.25219301277054884, 0.2521922705490059,
0.25219152830124, 0.25219078602725037, 0.25219004372703646, 0.25218930140059753, 0.25218855904793297,

0.2521878166690421, 0.2521878166690421, 0.25218633183257855, 0.2521855893750046, 0.25218484689120163]

traj_3 = [
    (0.25231894242085784-0.25231894242085784),
    (-0.2530801948783136+0.25231894242085784)*1000,
    # (0.2529179595155448-0.25231894242085784)*1000,
    # (0.2518559383142027-0.25231894242085784)*1000,
    (0.24996196485263583-0.25231894242085784)*1000,
    -6.046199999999999 + 0.05,
    -10.428859999999986 + 0.01,
    -15.767409999999984 + 0.00178,
    (0.23618154458493545-0.25231894242085784)*1000 - 5.823,
    (0.2317670790288384-0.25231894242085784)*1000 − 8.39,
    (0.22717254566292708-0.25231894242085784)*1000 - 11.489,
    223.50749 - 268.5324 + 0.004,
    214.46524 - 268.5324 - 0.005,
]

traj_4 = [
    (0.32094628487262084-0.32094628487262084)*1000,
    (0.30918550397998984-0.32094628487262084)*1000,
    (0.29745035206910214-0.32094628487262084)*1000,
    (0.2859252615867035-0.32094628487262084)*1000,
    (0.27476594771012103-0.32094628487262084)*1000,
    (0.2641060284231163-0.32094628487262084)*1000,
    (0.25403148100328893-0.32094628487262084)*1000,
    (0.24459382922580983-0.32094628487262084)*1000,
    (0.2358135193737392-0.32094628487262084)*1000,
    (0.22768695148365564-0.32094628487262084)*1000,
    (0.2201932133731823-0.32094628487262084)*1000,
]


a = (0.19917352975592328-0.25231894242085784)*1000
traj_rec_Y = [
268.5324 - 268.5324,
267.83232 - 268.5324,
265.77775 - 268.5324,
262.4862 - 268.5324,
258.10354 - 268.5324,
252.76499 - 268.5324,
246.57143 - 268.5324,
239.59875 - 268.5324,
231.89733 - 268.5324,
223.50749 - 268.5324,
214.46524 - 268.5324,
]

traj_rec_X = [
144.49242-144.49242,
130.43792-144.49242 + 2.2,
116.83073-144.49242 + 4.16,
104.00879-144.49242 + 5.46,
92.150176-144.49242 + 6.1,
81.292148-144.49242 + 2.955 + 3.40,
71.381108-144.49242 + 3.24 + 2.9,
62.344479-144.49242 + 5.7,
54.117107-144.49242 + 5.24,
46.670555-144.49242 + 4.5,
40.018914-144.49242+3.97+0.26-0.523,
]
# for i in 1:30
#     traj_rec[i] = (traj_rec[i]) * 0.001
# end

for i in 1:11
    traj_4[i] = abs(traj_4[i])
    traj_rec_X[i] = abs(traj_rec_X[i])
    traj_3[i] = abs(traj_3[i])
    traj_rec_Y[i] = abs(traj_rec_Y[i])
end




ax1 = Axis(f1[1,1], xscale = identity, aspect = AxisAspect(2),title="Траектория X",xlabel="Сила, Н",ylabel="Перемещение, мм")
ylims!( 0., 100.75307149943855)
Force = 0.1:0.1:10
length(Force)
l3 = lines!(ax1, 0.:0.4:4, traj_4, linestyle = :dot)
l4 = lines!(ax1, 0.:0.4:4, traj_rec_X, linestyle = :dash)
Legend(f1[1 , 2], [l3, l4], ["Flexia", "RecurDyn"], framevisible = false, halign = :left)
length(0.:0.4:4)

f2 = Figure()
ax2 = Axis(f2[1,1], xscale = identity, aspect = AxisAspect(2),title="Траектория Y",xlabel="Сила, Н",ylabel="Перемещение, мм")
ylims!( 0., 54.072160000000004,)
l5 = lines!(ax2, 0.:0.4:4, traj_rec_Y, linestyle = :dot)
l6 = lines!(ax2, 0.:0.4:4, traj_3, linestyle = :dash)
Legend(f2[1 , 2], [l6, l5], ["Flexia", "RecurDyn"], framevisible = false, halign = :left)

save("траектория.png", f1)
save("траектория2.png", f2)

traj_abs = [0.]
traj_abs_rec = [0.]
for i in 2:11
    push!(traj_abs,sqrt(traj_3[i]^2 + traj_4[i]^2))
    push!(traj_abs_rec,sqrt(traj_rec_X[i]^2 + traj_rec_Y[i]^2))
end
traj_abs
traj_abs_rec 

f3 = Figure()
ax3 = Axis(f3[1,1], xscale = identity, aspect = AxisAspect(2),title="Траектория",xlabel="Сила, Н",ylabel="Перемещение, мм")
ylims!(0., 114.34350040034955)
l1 = lines!(ax3, 0.:0.4:4, traj_abs, linestyle = :dot)
l2 = lines!(ax3, 0.:0.4:4, traj_abs_rec, linestyle = :dash)

Legend(f3[1 , 2], [l1, l2], ["Flexia", "RecurDyn"], framevisible = false, halign = :left)

save("траектория3.png", f3)

traj_error = [0.]
for i in 2:11
    push!(traj_error, traj_abs[i] - traj_abs_rec[i])
end
f4 = Figure()
ax4 = Axis(f4[1,1], xscale = identity, aspect = AxisAspect(2),title="График ошибки",xlabel="Сила, Н",ylabel="Перемещение, мм")
l_e = errorbars!(ax4, 0.:0.4:4, 0.:0.1:1, traj_error)
save("График ошибки.png", f4)